yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l101f1.h
#define MASK_TIM2_EGR_UG         0x01
#define MASK_TIM2_EGR_CC1G       0x02
#define MASK_TIM2_EGR_CC2G       0x04
#define MASK_TIM2_EGR_TG         0x40
#define MASK_TIM2_EGR_BG         0x80

#define MASK_TIM2_CCMR1_CAPTURE_CC1S 0x03
#define MASK_TIM2_CCMR1_CAPTURE_IC1PSC 0x0C
#define MASK_TIM2_CCMR1_CAPTURE_IC1F 0xF0

#define MASK_TIM2_CCMR1_COMPARE_CC1S 0x03
#define MASK_TIM2_CCMR1_COMPARE_OC1FE 0x04
#define MASK_TIM2_CCMR1_COMPARE_OC1PE 0x08
#define MASK_TIM2_CCMR1_COMPARE_OC1M 0x70

#define MASK_TIM2_CCMR2_CAPTURE_CC2S 0x03
#define MASK_TIM2_CCMR2_CAPTURE_IC2PSC 0x0C
#define MASK_TIM2_CCMR2_CAPTURE_IC2F 0xF0

#define MASK_TIM2_CCMR2_COMPARE_CC2S 0x03
#define MASK_TIM2_CCMR2_COMPARE_OC2FE 0x04
#define MASK_TIM2_CCMR2_COMPARE_OC2PE 0x08
#define MASK_TIM2_CCMR2_COMPARE_OC2M 0x70

#define MASK_TIM2_CCER1_CC1E     0x01
#define MASK_TIM2_CCER1_CC1P     0x02
#define MASK_TIM2_CCER1_CC2E     0x10
#define MASK_TIM2_CCER1_CC2P     0x20

#define MASK_TIM2_PSCR_PSC       0x07

#define MASK_TIM2_BKR_LOCK       0x03
#define MASK_TIM2_BKR_OSSI       0x04
#define MASK_TIM2_BKR_BKE        0x10
#define MASK_TIM2_BKR_BKP        0x20
#define MASK_TIM2_BKR_AOE        0x40
#define MASK_TIM2_BKR_MOE        0x80

#define MASK_TIM2_OISR_OIS1      0x01
#define MASK_TIM2_OISR_PIS2      0x04


/*-------------------------------------------------------------------------
 *      TIM3 register definitions
 *-----------------------------------------------------------------------*/
/* TIM3 Control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM3_CR1;
#endif
__IO_REG8_BIT(TIM3_CR1,    0x5280, __READ_WRITE, __BITS_TIM3_CR1);

/* TIM3 Control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM3_CR2;
#endif
__IO_REG8_BIT(TIM3_CR2,    0x5281, __READ_WRITE, __BITS_TIM3_CR2);

/* TIM3 Slave Mode Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM3_SMCR;
#endif
__IO_REG8_BIT(TIM3_SMCR,   0x5282, __READ_WRITE, __BITS_TIM3_SMCR);

/* TIM3 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM3_ETR;
#endif
__IO_REG8_BIT(TIM3_ETR,    0x5283, __READ_WRITE, __BITS_TIM3_ETR);

/* TIM3 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM3_IER;
#endif
__IO_REG8_BIT(TIM3_IER,    0x5284, __READ_WRITE, __BITS_TIM3_IER);

/* TIM3 Status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM3_SR1;
#endif
__IO_REG8_BIT(TIM3_SR1,    0x5285, __READ_WRITE, __BITS_TIM3_SR1);

/* TIM3 Status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM3_SR2;
#endif
__IO_REG8_BIT(TIM3_SR2,    0x5286, __READ_WRITE, __BITS_TIM3_SR2);

/* TIM3 Event Generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM3_EGR;
#endif
__IO_REG8_BIT(TIM3_EGR,    0x5287, __WRITE, __BITS_TIM3_EGR);

/* TIM3 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char IC1PSC      : 2;
  unsigned char IC1F        : 4;
} __BITS_TIM3_CCMR1_CAPTURE;
#endif
__IO_REG8_BIT(TIM3_CCMR1_CAPTURE, 0x5288, __READ_WRITE, __BITS_TIM3_CCMR1_CAPTURE);

/* TIM3 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM3_CCMR1_COMPARE;
#endif
__IO_REG8_BIT(TIM3_CCMR1_COMPARE, 0x5288, __READ_WRITE, __BITS_TIM3_CCMR1_COMPARE);

/* TIM3 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char IC2PSC      : 2;
  unsigned char IC2F        : 4;
} __BITS_TIM3_CCMR2_CAPTURE;
#endif
__IO_REG8_BIT(TIM3_CCMR2_CAPTURE, 0x5289, __READ_WRITE, __BITS_TIM3_CCMR2_CAPTURE);

/* TIM3 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM3_CCMR2_COMPARE;
#endif
__IO_REG8_BIT(TIM3_CCMR2_COMPARE, 0x5289, __READ_WRITE, __BITS_TIM3_CCMR2_COMPARE);

/* TIM3 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM3_CCER1;
#endif
__IO_REG8_BIT(TIM3_CCER1,  0x528A, __READ_WRITE, __BITS_TIM3_CCER1);

/* TIM3 Counter high */
__IO_REG8    (TIM3_CNTRH,  0x528B, __READ_WRITE);
/* TIM3 Counter low */
__IO_REG8    (TIM3_CNTRL,  0x528C, __READ_WRITE);
/* TIM3 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM3_PSCR;
#endif
__IO_REG8_BIT(TIM3_PSCR,   0x528D, __READ_WRITE, __BITS_TIM3_PSCR);

/* TIM3 Auto-reload register high */
__IO_REG8    (TIM3_ARRH,   0x528E, __READ_WRITE);
/* TIM3 Auto-reload register low */
__IO_REG8    (TIM3_ARRL,   0x528F, __READ_WRITE);
/* TIM3 Capture/Compare register 1 high */
__IO_REG8    (TIM3_CCR1H,  0x5290, __READ_WRITE);
/* TIM3 Capture/Compare register 1 low */
__IO_REG8    (TIM3_CCR1L,  0x5291, __READ_WRITE);
/* TIM3 Capture/Compare register 2 high */
__IO_REG8    (TIM3_CCR2H,  0x5292, __READ_WRITE);
/* TIM3 Capture/Compare register 2 low */
__IO_REG8    (TIM3_CCR2L,  0x5293, __READ_WRITE);
/* TIM3 Break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM3_BKR;
#endif
__IO_REG8_BIT(TIM3_BKR,    0x5294, __READ_WRITE, __BITS_TIM3_BKR);

/* TIM3 Output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char PIS2        : 1;
} __BITS_TIM3_OISR;
#endif
__IO_REG8_BIT(TIM3_OISR,   0x5295, __READ_WRITE, __BITS_TIM3_OISR);


/*-------------------------------------------------------------------------
 *      TIM3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

